references/Track Transaction/SignatureProofOfDeliveryLetterRequest.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v10="http://fedex.com/ws/track/v10">
   <soapenv:Header/>
   <soapenv:Body>
      <v10:SignatureProofOfDeliveryLetterRequest>
       <v10:WebAuthenticationDetail>
<v10:UserCredential>
               <v10:Key>Input Your Information</v10:Key>
               <v10:Password>Input Your Information</v10:Password>
            </v10:UserCredential>
         </v10:WebAuthenticationDetail>
         <v10:ClientDetail>
            <v10:AccountNumber>Input Your Information</v10:AccountNumber>
            <v10:MeterNumber>Input Your Information</v10:MeterNumber>
       </v10:ClientDetail>   
 <v10:TransactionDetail>
            <v10:CustomerTransactionId>SignatureProofOfDeliveryLetterRequest_v10</v10:CustomerTransactionId>
            <v10:Localization>
               <v10:LanguageCode>EN</v10:LanguageCode>
            </v10:Localization>
         </v10:TransactionDetail>
         <v10:Version>
            <v10:ServiceId>trck</v10:ServiceId>
            <v10:Major>10</v10:Major>
            <v10:Intermediate>0</v10:Intermediate>
            <v10:Minor>0</v10:Minor>
         </v10:Version>
         <v10:QualifiedTrackingNumber>
            <v10:TrackingNumber>Input Your Information</v10:TrackingNumber>
            <v10:ShipDate>2014-07-10</v10:ShipDate>
            <v10:AccountNumber>Input Your Information</v10:AccountNumber>
            <v10:Carrier>FDXE</v10:Carrier>
            <v10:Destination>
               <v10:StreetLines>Input Your Information</v10:StreetLines>
               <v10:City>Texas</v10:City>
               <v10:StateOrProvinceCode>TX</v10:StateOrProvinceCode>
               <v10:PostalCode>73301</v10:PostalCode>
               <v10:CountryCode>US</v10:CountryCode>
            </v10:Destination>
         </v10:QualifiedTrackingNumber>
         <v10:LetterFormat>PNG</v10:LetterFormat>
         <v10:Consignee>
            <v10:Contact>
               <v10:PersonName>Input Your Information</v10:PersonName>
               <v10:Title>Input Your Information</v10:Title>
               <v10:CompanyName>Input Your Information</v10:CompanyName>
               <v10:PhoneNumber>Input Your Information</v10:PhoneNumber>
               <v10:PhoneExtension>Input Your Information</v10:PhoneExtension>
               <v10:PagerNumber>Input Your Information</v10:PagerNumber>
               <v10:FaxNumber>Input Your Information</v10:FaxNumber>
               <v10:EMailAddress>Input Your Information</v10:EMailAddress>
            </v10:Contact>
            <v10:Address>
               <v10:StreetLines>Input Your Information</v10:StreetLines>
               <v10:City>INDIANAPOLIS</v10:City>
               <v10:StateOrProvinceCode>IN</v10:StateOrProvinceCode>
               <v10:PostalCode>46279</v10:PostalCode>
               <v10:CountryCode>US</v10:CountryCode>
            </v10:Address>
         </v10:Consignee>
      </v10:SignatureProofOfDeliveryLetterRequest>
   </soapenv:Body>
</soapenv:Envelope>